app/controllers/bands_controller.rb

  def create
    @band = Band.find_by(band_params)
    @user = current_user
    if !@band
      # if band cannot be found, do not add to a user account
      render :layout => false
    elsif @user.bands.include?(@band)
      # if band can be found but already belongs to a user, do not add to user account
      flash.now[:notice] = "Artist already added"
      render :layout => false
    else
      # add band to user account
      @user.bands << @band
---
SELECT "bands".* FROM "bands" INNER JOIN "user_bands" ON "bands"."id" = "user_bands"."band_id" WHERE "user_bands"."user_id" = $1  [["user_id", 1]]
INSERT INTO "user_bands" ("user_id", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["band_id", 95], ["created_at", "2015-03-31 20:14:43.556122"], ["updated_at", "2015-03-31 20:14:43.556122"]]