app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "cghazanfar10@gmail.com"]]
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL AND "users"."password" IS NULL LIMIT 1
---
  def create
    #allow user to sign in w/ facebook or with a nomo account
    if request.env['omniauth.auth']
      #sign in or up with facebook
      if User.find_by(email: request.env['omniauth.auth'].info.email)
        @user = User.find_by(email: request.env['omniauth.auth'].info.email)
        log_in(@user)
        redirect_to root_path
      else
        binding.pry
        @user = User.new
        @user = User.from_omniauth(env["omniauth.auth"], @user)
        log_in(@user)
        redirect_to root_path
      end
    else
      @user = User.find_by(email: params[:user][:email]).try(:authenticate, params[:user][:password])