app/controllers/users_controller.rb

  def create
    # creating a new user account from
    # the "users#new" route
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"